tutorials/CFD/22datadriven_corrections/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
23266
(
-7.89362e-05
0.0313289
-0.000157563
0.0313286
-0.000235505
0.0313279
-0.000312248
0.0313267
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
-0.03125
-0.03125
-0.03125
-0.03125
-0.03125
-0.03125
-0.03125
-0.03125
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
40
(
0.03125
0.03125
0.03125
0.03125
0.03125
0.03125
0.03125
0.03125
...
)
;
    }
    down
    {
        type            empty;
        value           nonuniform 0();
    }
    up
    {
        type            empty;
        value           nonuniform 0();
    }
    sides
    {
        type            calculated;
        value           uniform 0;
    }
    cylinder1
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
